# AssemblyDifference Properties

---
The AssemblyDifference type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
AssemblyDifference Class
Autodesk.Revit.DB Namespace